src/cf/InformationRegisters/ОтправкаВRabbitMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтправкаВRabbitMQ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтметкаОбОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Салон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Салоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/Запись.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Запись</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияЗаписей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Салон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Салоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Клиенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/РабочийМодуль/Ext/Module.bsl
Процедура ПодпискаНаСобытиеЗаписиНоменклатуры(Источник, Отказ) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОтправкаВRabbitMQ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Источник.Ссылка;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщение() Экспорт
	
	//В данной настройке можно определить для каждого сообщения свой ключ маршрутизации. Сделать несколько активных записей в регистре с растройками 
	//и брать нужный под необходимые цели
	Настройки = RebbitMQСервер.ПолучитьНастройкиПодключенияИзРегистра();
	Компонента = RebbitMQСервер.ПолучитьКомпоненту();
	
	//Проверка по условию. Можно реализовать любого рода проверку
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправкаВRabbitMQ.Салон КАК Салон,
		|	ОтправкаВRabbitMQ.Сотрудник КАК Сотрудник,
		|	ОтправкаВRabbitMQ.Услуга КАК Услуга,
		|	ОтправкаВRabbitMQ.Клиент КАК Клиент,
		|	ОтправкаВRabbitMQ.Комментарий КАК Комментарий,
		|	ОтправкаВRabbitMQ.Дата КАК Дата,
		|	ОтправкаВRabbitMQ.ТелефонКлиента КАК ТелефонКлиента
		|ИЗ
		|	РегистрСведений.ОтправкаВRabbitMQ КАК ОтправкаВRabbitMQ
		|ГДЕ
		|	ОтправкаВRabbitMQ.ОтметкаОбОтправке = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//МассивНоменклатур = Новый Массив;
	СтруктураУслуг = Новый Структура;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураУслуг.Вставить("Салон",Строка(ВыборкаДетальныеЗаписи.Салон)); 
		СтруктураУслуг.Вставить("Сотрудник",Строка(ВыборкаДетальныеЗаписи.Сотрудник));
		СтруктураУслуг.Вставить("Услуга",Строка(ВыборкаДетальныеЗаписи.Услуга));
		СтруктураУслуг.Вставить("Клиент",Строка(ВыборкаДетальныеЗаписи.Клиент));
		СтруктураУслуг.Вставить("Комментарий",Строка(ВыборкаДетальныеЗаписи.Комментарий));
		СтруктураУслуг.Вставить("Дата",Строка(ВыборкаДетальныеЗаписи.Дата));  
		СтруктураУслуг.Вставить("ТелефонКлиента",ВыборкаДетальныеЗаписи.ТелефонКлиента);
		
		//МассивНоменклатур.Добавить(Строка(ВыборкаДетальныеЗаписи.Салон));
		//МассивНоменклатур.Добавить(Строка(ВыборкаДетальныеЗаписи.Сотрудник));
		//МассивНоменклатур.Добавить(Строка(ВыборкаДетальныеЗаписи.Услуга)); 
		//МассивНоменклатур.Добавить(Строка(ВыборкаДетальныеЗаписи.Клиент));
		//МассивНоменклатур.Добавить(Строка(ВыборкаДетальныеЗаписи.Комментарий));
		//МассивНоменклатур.Добавить(Строка(ВыборкаДетальныеЗаписи.Дата));
		//МассивНоменклатур.Добавить(Строка(ВыборкаДетальныеЗаписи.Время));
		
	КонецЦикла;                              
	
	//Если ТекСообщение <> Неопределено Тогда
	Если СтруктураУслуг.Количество() > 0 Тогда
		//ТекстJSON = RebbitMQКлиентСервер.СериализоватьВJSON(ТекСообщение);
		ТекстJSON = RebbitMQКлиентСервер.СериализоватьВJSON(СтруктураУслуг);
		RebbitMQКлиентСервер.ОтправитьСообщение(Компонента, Настройки, ТекстJSON);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПолучитьИзRabbitMQ() Экспорт
	
	Попытка
		
		Настройки = RebbitMQСервер.ПолучитьНастройкиПодключенияИзРегистра();
		Компонента = RebbitMQСервер.ПолучитьКомпоненту();
		
		Ответ = RebbitMQКлиентСервер.ПрочитатьСообщение(Компонента, Настройки);  
		
		Если Ответ = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		
		ГотовыйОтвет = RebbitMQКлиентСервер.ДесериализоватьИзJSON(Ответ);
		
		//Для каждого СтрокаОтвета Из ГотовыйОтвет Цикл
		
		Салон = Справочники.Салоны.НайтиПоНаименованию(ГотовыйОтвет.Салон);
		Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ГотовыйОтвет.Сотрудник); 
		Услуга = Справочники.Услуги.НайтиПоНаименованию(ГотовыйОтвет.Услуга);
		Если Справочники.Клиенты.НайтиПоНаименованию(ГотовыйОтвет.Клиент) <> Справочники.Клиенты.ПустаяСсылка() Тогда
			Клиент = Справочники.Клиенты.НайтиПоНаименованию(ГотовыйОтвет.Клиент);
		Иначе
			НовыйКлиент = Справочники.Клиенты.СоздатьЭлемент();
			НовыйКлиент.Наименование = ГотовыйОтвет.Клиент;
			НовыйКлиент.Телефон = ГотовыйОтвет.ТелефонКлиента; 
			НовыйКлиент.Записать();
			Клиент = НовыйКлиент;
		КонецЕсли;
		
		
		
		Комментарий = ГотовыйОтвет.Комментарий;
		Дата = Дата(ГотовыйОтвет.Дата);
		Длительность = Услуга.Длительность;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(, Услуга = &Услуга) КАК ЦеныСрезПоследних";
		
		Запрос.УстановитьПараметр("Услуга", Услуга);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			//Нужно отработать
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сумма = ВыборкаДетальныеЗаписи.Цена;
		КонецЦикла;
		
		СозданнаяЗапись = Документы.Запись.СоздатьДокумент();
		СозданнаяЗапись.Салон = Салон;
		СозданнаяЗапись.Сотрудник = Сотрудник;
		СозданнаяЗапись.Услуга = Услуга;
		СозданнаяЗапись.Клиент = Клиент;
		СозданнаяЗапись.Комментарий = Комментарий;
		СозданнаяЗапись.Дата = Дата;
		СозданнаяЗапись.Длительность = Услуга.Длительность;
		СозданнаяЗапись.Сумма = Сумма;
		СозданнаяЗапись.Цвет = Новый Цвет(184,202,255);   
		СозданнаяЗапись.ДатаОкончания = Дата  + Длительность * 60;
		//СозданнаяЗапись.Проведен = Истина;
		СозданнаяЗапись.Записать(РежимЗаписиДокумента.Проведение);
		
		ТекЗапись = РегистрыСведений.ОтправкаВRabbitMQ.СоздатьМенеджерЗаписи();
		ТекЗапись.Салон = Салон; 
		ТекЗапись.Сотрудник = Сотрудник;
		ТекЗапись.Услуга = Услуга;
		ТекЗапись.Клиент = Клиент;
		ТекЗапись.Комментарий = Комментарий;
		ТекЗапись.Дата = Дата;
		ТекЗапись.Прочитать();
		ТекЗапись.ОтметкаОбОтправке  = Истина;
		ТекЗапись.Записать();					
		
	Исключение
		//Отрабатываем исключение. Сообщение, письмо на почту и тд
		
	КонецПопытки;
	
КонецПроцедуры
